# Pandas
__________
**`Pandas:`** Pandas is a Python package that offers various data structures and operations for manipulating numerical data and time series.
              Mainly popular for importing and analyzing data much easier.

In [1]:
# !pip install pandas
import pandas as pd

> ## Series
_Pandas series is 1-D labeled array capable of holding data of any type._

In [6]:
# series through list

lst = [1, 2, 3, 4]
pd.Series(lst)

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
# series through NUMPY

import numpy as np
arr = np.array([1, 2, 3, 4])
pd.Series(arr)

0    1
1    2
2    3
3    4
dtype: int64

__Giving Index from our own end__

In [13]:
pd.Series(data = ['mnr', 'ram', 'rahul', 'sai'], index = [1, 2 ,3, 4])

1      mnr
2      ram
3    rahul
4      sai
dtype: object

__Series through Dictionary__

In [14]:
d = {1: 'MNR', 2: 'pravs', 3: 'hari'}
pd.Series(d)

1      MNR
2    pravs
3     hari
dtype: object

#### Using `repeat` function along with creating a Series

Pandas Series.repeat() function repeat elements of a Series. It returns a new Series where each element of the current Series is repeated consecutively a given number of times.

In [4]:
pd.Series('MNR').repeat(3)

0    MNR
0    MNR
0    MNR
dtype: object

We can use the reset_index to make the index accurate

In [7]:
# type(pd.Series(5).repeat(3).reset_index())   --> DataFrame
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

The below code indicates:
- MNR should be repeated 3 times and 
- Narendra should be repeated 4 times
- Reddy should be repeated 3 times
- and so on

In [ ]:
s = pd.Series(['MNR', "Narendra", 'Reddy']).repeat([3, 4, 3]).reset_index(drop=True)
s

#### Accessing elements

In [15]:
print(s[0], s[4], s[8])

MNR Narendra Reddy

Slicing
Mostly similar as slicing in list

In [ ]:
# s[:]
# s[0:4]
# s[0:-5]
# s[0:10:2]
# s[::-1]

### `Aggregate function` on pandas Series

Pandas Series.aggregate() function aggregate using one or more operations over the specified axis in the given series object.

In [10]:
ar = pd.Series([1, 2, 3, 4, 5, 6, 7, 8])
# a = ar.agg([min:= 'min', max := 'max', sum := 'sum', 'mean', 'median', product := 'prod'])
# a[product]
ar.agg(['min', 'max', 'sum', 'mean', 'median', 'prod'])   # `agg` is an alias for `aggregate`

min           1.0
max           8.0
sum          36.0
mean          4.5
median        4.5
prod      40320.0
dtype: float64

### Series `absolute` function

> Pandas Series.abs() method is used to get the absolute numeric value of each element in Series/DataFrame.

In [ ]:
sr = pd.Series([1, -3, 4, -67, 4, 5 -23])
sr.abs()

### `Appending Series`

> Pandas Series.concat() function is used to concatenate two or more series object.

In [6]:
sr1 = pd.Series(['a', 'b', 'c'])
sr2 = pd.Series(['f', 'r'])
sr3 = pd.concat([sr1, sr2]).reset_index(drop = True)
sr3

0    a
1    b
2    c
3    f
4    r
dtype: object

### `astype` function

> Used to chage data type of series

In [15]:
sr = pd.Series([1, -4, 5, -2])
sr

0    1
1   -4
2    5
3   -2
dtype: int64

In [16]:
sr.astype('float')

0    1.0
1   -4.0
2    5.0
3   -2.0
dtype: float64

### `between` function

> Pandas Series.between(): Return boolean Series equivalent to left <= series <= right.

In [20]:
sr = pd.Series([10, 20, 5, 3, 40, 30, 12])
sr.between(10, 30, inclusive='neither')     # default inclusive = 'both'

0    False
1     True
2    False
3    False
4    False
5    False
6     True
dtype: bool

### All `string functions` can to used to extract or modify strings in a series

> `upper`, `lower`, `title`, `capitalize`, `casefold` and `swapcase` functions

In [7]:
siri = pd.Series(["Narendra Reddy" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])

In [29]:
# siri.str.upper()
# siri.str.lower()
# siri.str.title()
# siri.str.capitalize()
# siri.str.casefold()
# siri.str.swapcase()

> `strip` function

In [ ]:
siri = pd.Series(["  Narendra Reddy" , "Data Science  " , "Geeks for Geeks" , 'Hello World' , 'Machine Learning  '])
siri.str.strip()
# print(siri)

> `split` function

In [10]:
siri = pd.Series(["Narendra Reddy" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])
# siri.str.split(n = 1)
# siri.str.split()[0][1]
siri.str.split()

0      [Narendra, Reddy]
1        [Data, Science]
2    [Geeks, for, Geeks]
3         [Hello, World]
4    [Machine, Learning]
dtype: object

> `contains` function

In [ ]:
siri = pd.Series(["Narendra Reddy" , "Data@Science" , "Geeks for Geeks" , 'Hello@World' , 'Machine Learning'])
siri.str.contains('@')

> `replace` function

In [ ]:
siri = siri.str.replace('@', ' ')
print(siri)

> `count` function

In [ ]:
siri.str.count('a')

> `startswith` and `endswith` function

In [56]:
# siri.str.startswith('N')
siri.str.endswith('s')

0    False
1    False
2     True
3    False
4    False
dtype: bool

> `find` function

In [ ]:
# s = 'Narendra'
# s.find('d')     #Return the lowest index in S where substring sub is found, such that sub is contained within S[start:end].
siri.str.find('Geeks')

In [ ]:
siri.str.findall('Geeks')

### Converting Series to list

> `to_list()` function is used to convert series to list.

In [7]:
li = siri.to_list()
print(li)

['Narendra Reddy', 'Data Science', 'Geeks for Geeks', 'Hello World', 'Machine Learning']

# <font color='green'> Detailed coding Implementations on Pandas DataFrame </font>
___

In [4]:
li = [['gun', 30], ['bullet', 2], ['riffle', 40]]
pd.DataFrame(li, columns=['Name', 'Price'])

     Name  Price
0     gun     30
1  bullet      2
2  riffle     40

In [19]:
pd.DataFrame([{1:'a', 2:'b', 3:'c', 4:'d'}, {1:'f', 2:'g',3:'h', 4:'i'}], index=['one','two'])

     1  2  3  4
one  a  b  c  d
two  f  g  h  i

- `set_axis()`
- `set_index()`
- `agg()`
- `astype()`

In [36]:
import pandas as pd
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}
df = pd.DataFrame(data).set_axis(['Name', 'years'], axis=1)
df.set_index(['Name'])
# df.reset_index()

# aggregtion
df_agg = df.agg({'years': ['min', 'max', 'sum', 'mean']})
df_agg.astype('int')    # default dtype -> float

      years
min      18
max      21
sum      78
mean     19

In [35]:
# df['years'].add(1)   # <-->  df['years'] + 1

- `add_prefix()`
- `add_suffix()`

In [40]:
# df.add_prefix('row_', axis=0)
df.add_suffix('_col')

  Name_col  years_col
0      Tom         20
1     nick         21
2    krish         19
3     jack         18

In [3]:
# d = {'a': 'A', 'b': 'B'}
# pd.DataFrame(d, index = [1])
d = {'Name':{1: ['Tom', 'mnr'], 2: 'nick', 3: 'krish', 4: 'jack'}, 'Age':{1: 20, 'b': 21, 'c': 19, 'd': 18}}
pd.DataFrame(d)

         Name   Age
1  [Tom, mnr]  20.0
2        nick   NaN
3       krish   NaN
4        jack   NaN
b         NaN  21.0
c         NaN  19.0
d         NaN  18.0

In [ ]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

In [ ]:
tuples = [('apple', 10), ('banana', 20), ('cherry', 30), ('date', 40), ('elderberry', 50)]
df = pd.DataFrame(tuples, columns=['Fruit', 'Quantity'])
df.set_index('Fruit')

### Slicing in DataFrame using `iloc` and `loc`

In [45]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield', 'war'])
df

            max_speed  shield  war
cobra               1       2    3
viper               4       5    6
sidewinder          7       8    9

#### `loc` operations

In [16]:
print(f'type: {type(df.loc['viper'])}')
df.loc['viper']

type: <class 'pandas.core.series.Series'>

max_speed    4
shield       5
war          6
Name: viper, dtype: int64

In [7]:
df.loc[['viper', 'cobra']]

       max_speed  shield  war
viper          4       5    6
cobra          1       2    3

In [18]:
df.loc['viper', 'max_speed']

np.int64(4)

In [14]:
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [20]:
# df.loc[['cobra', 'viper'] , ['max_speed', 'shield']]
df.loc['cobra':'viper', 'shield':'war']

       shield  war
cobra       2    3
viper       5    6

In [50]:
df.loc[[False, True, False]]          # The length of boolean list is must be equal to number of rows
# df.loc[[False, True, False], [False, True, False]]

       max_speed  shield  war
viper          4       5    6

In [51]:
df.loc[pd.Series([False, False, True], index=['cobra', 'viper', 'sidewinder'])]          #Alignable boolean Series

            max_speed  shield  war
sidewinder          7       8    9

In [53]:
df.loc[df['shield'] > 4]

            max_speed  shield  war
viper               4       5    6
sidewinder          7       8    9

In [36]:
df.loc[df['shield'] > 4, ['shield', 'war']]

            shield  war
viper            5    6
sidewinder       8    9

In [38]:
df.loc[lambda df: df['shield'] == 8]

            max_speed  shield  war
sidewinder          7       8    9

Set value for all items matching the list of labels

In [40]:
df.loc[['cobra', 'viper'], ['war']] = 23
df

            max_speed  shield  war
cobra               1       2   23
viper               4       5   23
sidewinder          7       8    9

set value for an entire row

In [42]:
df.loc['sidewinder'] = 100
df

            max_speed  shield  war
cobra               1       2   23
viper               4       5   23
sidewinder        100     100  100

set value for an entire column

In [56]:
df.loc[:, 'max_speed'] = 40       # <--> df['max_speed'] = 40
df

            max_speed  shield  war
cobra              40       2    3
viper              40       5    6
sidewinder         40       8    9

In [11]:
tuples = [
    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ('viper', 'mark ii'), ('viper', 'mark iii')
]
index = pd.MultiIndex.from_tuples(tuples)
values = [[12, 2], [0, 4], [10, 20],
          [1, 4], [7, 1], [16, 36]]
df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
df

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

#### `iloc` operations

> iloc is an index based selecting method which means we have to pass purely integer index to select a specific row/ column

In [3]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [7]:
# df.iloc[0]         --> Series
df.iloc[[0]]      # -->DataFrame

   a  b  c  d
0  1  2  3  4

In [18]:
# df.iloc[[0,1]]
df.iloc[[0,2], [0, 1, 3]]

      a     b     d
0     1     2     4
2  1000  2000  4000

In [27]:
df.iloc[0:-1, 0:-2]

     a    b
0    1    2
1  100  200

In [19]:
df.iloc[[True, False, True]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [26]:
# df.iloc[lambda df: [0, 2]]             here the result is same if, iloc <-> loc
df.iloc[lambda x: x.index %2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

### Slicing using conditions

In [57]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [59]:
df.loc[df['two'] > 20, ['three', 'two']]
# df[df['two'] > 20]

   three  two
2    300   30
3    400   40

### Adding Column into DataFrame

We can add a column in many ways. Let us discuss three ways how we can add column here
- Using List
- Using Pandas Series
- Using an existing Column(we can modify that column in the way we want and that modified part can also be displayed)

In [ ]:
li = [11, 22, 33, 44]
df['five'] = li
df

In [ ]:
sr = pd.Series([111, 222,333, 444])
df['six'] = sr
df

In [ ]:
df['seven'] = df['one']+10
df

### deleting Column in DataFrame

- del
- drop
- pop

In [ ]:
del df['six']
df

In [50]:
# df.drop(['seven'], axis=1, inplace=True)
# or                                                 axis = 1 -> columns,   axis = 0 -> rows
# df.drop(columns=['seven'], inplace=True)

In [61]:
# df.pop('five')

### Adding row into DataFrame

In [63]:
data = {'Fruit': ['apple', 'banana', 'cherry'], 'Quantity': [10, 20, 30]}
df = pd.DataFrame(data)

new_row = {'Fruit': ['date'], 'Quantity': [40]}
df_new = pd.DataFrame(new_row)

df = pd.concat([df, df_new], ignore_index=True)
df

    Fruit  Quantity
0   apple        10
1  banana        20
2  cherry        30
3    date        40

#### Transposing a DataFrame

pandas `DataFrame.T ` instance is used to transpose the DataFrame, i.e., to flip the rows and columns.

In [3]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [4]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

### more DataFrame functionalities

- axes instance
> Return a list representing the axes of the DataFrame.

In [7]:
print(df.axes)

[RangeIndex(start=0, stop=4, step=1), Index(['one', 'two', 'three', 'four'], dtype='object')]

- ndim
>Return an int representing the number of axes / array dimensions. Return 1 if Series. Otherwise return 2 if DataFrame.

In [8]:
df.ndim

2

- dtypes
> This returns a Series with the data type of each column.

In [10]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

- shape

In [11]:
df.shape

(4, 4)

`head(), tail()`

In [ ]:
d = {'length': np.linspace(1, 19, num = 10), 'breadth': np.linspace(100, 199, num = 10)}
df = pd.DataFrame(d)
df

In [20]:
df.head(-8)

   length  breadth
0     1.0    100.0
1     3.0    111.0

In [ ]:
df.tail()

- empty

In [24]:
df_emp = pd.DataFrame()
df_emp.empty

True

### Statistical or Mathmatical Functions

In [32]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

- DataFrame.sum : Return the sum over the requested axis.
- DataFrame.min : Return the minimum over the requested axis.
- DataFrame.max : Return the maximum over the requested axis.
- DataFrame.idxmin : Return the index of the minimum over the requested axis.
- DataFrame.idxmax : Return the index of the maximum over the requested axis.

In [ ]:
# df.sum()
# df[['one', 'two']].sum()

# performing sum operation along rows
# df.loc[0].sum()
# df.loc[0, ['two', 'three']].sum()

# df.sum(axis=1

# df.max(axis=0)

# df.idxmax(axis=1)

2. mean()

In [ ]:
df.mean()

In [ ]:
df.mode()

In [ ]:
df.median()

In [ ]:
df.var()

In [ ]:
df.std()

### `describe` function

In [47]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000]),
        'five'  : pd.Series(['A', 'B', 'C', 'D'])}
df = pd.DataFrame(data)
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

> Note: quantile function is used to find percentiles of the data

In [52]:
print(f'25%: {df['one'].quantile(.25)}')    # 25%
df[['one']].quantile(.75)

25%: 1.75

one    3.25
Name: 0.75, dtype: float64

In [54]:
df.describe(exclude=[object])

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [55]:
df.describe(include=[object])

       five
count     4
unique    4
top       A
freq      1

In [56]:
# describing a column by taking col as attribute from DataFrame
df.two.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
Name: two, dtype: float64

In [ ]:
df[['two', 'four']].describe()

### `corr()` function

In [9]:
company = pd.read_csv('065. Company_Data - opendir.cloud.csv')
company.head()

,Sales,CompPrice,Income,Advertising,Population,Price,Age,Education,Urban,US
0,9.50,138,73,11,276,120,42,17,Yes,Yes
1,11.22,111,48,16,260,83,65,10,Yes,Yes
2,10.06,113,35,10,269,80,59,12,Yes,Yes
3,7.40,117,100,4,466,97,55,14,Yes,Yes
4,4.15,141,64,3,340,128,38,13,Yes,No

In [14]:
# company.drop(columns=['Urban', 'US'], inplace=True)
company.corr()

,Sales,CompPrice,Income,Advertising,Population,Price,Age,Education
Sales,1.000000,0.064079,0.151951,0.269507,0.050471,-0.444951,-0.231815,-0.051955
CompPrice,0.064079,1.000000,-0.080653,-0.024199,-0.094707,0.584848,-0.100239,0.025197
Income,0.151951,-0.080653,1.000000,0.058995,-0.007877,-0.056698,-0.004670,-0.056855
Advertising,0.269507,-0.024199,0.058995,1.000000,0.265652,0.044537,-0.004557,-0.033594
Population,0.050471,-0.094707,-0.007877,0.265652,1.000000,-0.012144,-0.042663,-0.106378
Price,-0.444951,0.584848,-0.056698,0.044537,-0.012144,1.000000,-0.102177,0.011747
Age,-0.231815,-0.100239,-0.004670,-0.004557,-0.042663,-0.102177,1.000000,0.006488
Education,-0.051955,0.025197,-0.056855,-0.033594,-0.106378,0.011747,0.006488,1.000000

### `Pipe` function

The pipe() method in a pandas DataFrame allows you to apply a function to the DataFrame, similar to apply() method works. The difference is that pipe() allows you to chain multiple operations together by passing the output of one func to the input of next func

In [5]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)

In [4]:
def add_(i, j):
    return i+j
df.pipe(add_, 10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [3]:
def add_(i):
    return i
df.pipe(add_)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [5]:
def mean_(col):
    return col.mean()
def square(i):
    return i**2
    
df.pipe(mean_).pipe(square)       # mean square

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

#### `apply()` function

In [16]:
import numpy as np
# df.apply(lambda x: x+1)       # element-wise
df.apply(np.sum)

one         10
two        100
three     1000
four     10000
dtype: int64

In [ ]:
df.apply(lambda x: [1, 2], axis = 1, result_type='expand')

#### `applymap()` function

In [ ]:
df[['one']].map(lambda x: x+10)            # FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.

> `note: ` applymap is meant for element-wise operations while apply can can be used for both element-wise and row/column operations

#### `reindex()` function

The reindex function in Pandas is used to change the row labels and/or column labels of a DataFrame. This function can be used to align data from multiple DataFrames or to update the labels based on new data. The function takes in a list or an array of new labels as its first argument and, optionally, a fill value to replace any missing values. The reindexing can be done along either the row axis (0) or the column axis (1). The reindexed DataFrame is returned.

In [1]:
import pandas as pd
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                   'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                   index=index)

In [2]:
print(df)

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [21]:
# By default values in the new index that do not have corresponding records in the dataframe are assigned ``NaN``.
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10', 'Chrome']
df.reindex(new_index)

               http_status  response_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               200.0           0.02

In [23]:
df.reindex(new_index, fill_value='missing')

              http_status response_time
Safari                404          0.07
Iceweasel         missing       missing
Comodo Dragon     missing       missing
IE10                  404          0.08
Chrome                200          0.02

In [3]:
# df.reindex(['response_time', 'http_status'], axis='columns')
# or
df.reindex(columns=['response_time', 'http_status'])

           response_time  http_status
Firefox             0.04          200
Chrome              0.02          200
Safari              0.07          404
IE10                0.08          404
Konqueror           1.00          301

#### `rename()` function

The rename function in Pandas is used to change the row labels and/or column labels of a DataFrame. It can be used to update the names of one or multiple rows or columns by passing a dictionary of new names as its argument. The dictionary should have the old names as keys and the new names as values.

In [6]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)

In [13]:
# df.rename(columns={'one': 'Eak', 'two':'Dho'}, index={2: 'b', 1:'a'})
df.rename({'one': 'Eak', 'two':'Dho'}, axis='columns')     # or df.rename({'one': 'Eak', 'two':'Dho'}, axis=1)

   Eak  Dho  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [18]:
# Set the name of the axis for the index or columns.
df.rename_axis('index')

       one  two  three  four
index
0        1   10    100  1000
1        2   20    200  2000
2        3   30    300  3000
3        4   40    400  4000

#### `Sorting` in DataFrame

Pandas provides several methods to sort a DataFrame based on one or more columns. 

- sort_values: This method sorts the DataFrame based on one or more columns. The default sorting order is ascending, but you can change it to descending by passing the ascending argument with a value of False.
bash

In [50]:
data = {'one'   : pd.Series([3, 2, 4, 1]),
        'two'   : pd.Series([10, 80, 30, 40]),
        'three' : pd.Series([100, 20, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)

In [55]:
# df.sort_values(by = ['two', 'one'])
df.sort_values(by = ['one'], ignore_index=True)
# df.sort_values(by = 1, ignore_index=True, axis=1)
# df.sort_values(by = ['one', 'two'])

   one  two  three  four
0    1   40    400  4000
1    2   80     20  2000
2    3   10    100  1000
3    4   30    300  3000

In [38]:
df.sort_values(by = ['one'], ignore_index=True, ascending=False, kind = 'mergesort')

   one  two  three  four
0    4   30    300  3000
1    3   10    100  1000
2    2   20    200  2000
3    1   40    400  4000

- `sort_index()` function

In [41]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150], columns=['A'])
df.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

#### `groupby()` function

The groupby function in pandas is used to split a dataframe into groups based on one or more columns. It returns a DataFrameGroupBy object, which is similar to a DataFrame but has some additional methods to perform operations on the grouped data.

In [58]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [60]:
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [62]:
df.groupby('Team').get_group('India')

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
11  India     2  2017     782

`To search specific country with specific year`

In [64]:
df.groupby(['Team', 'Year']).get_group(('Australia', 2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [75]:
# df.groupby('Team')[['Points']].sum()
df.groupby('Team').sum()['Points'].sort_values(ascending = False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64

In [76]:
groups = df.groupby('Team')
groups['Points'].agg(['min', 'max', 'sum', 'mean'])

           min  max   sum        mean
Team
Australia  815  891  1706  853.000000
India      782  876  2459  819.666667
NZ         691  883  2332  777.333333
SA         776  834  3218  804.500000

In [81]:
df.groupby('Team')[['Team', 'Points']].filter(lambda x: len(x) == 3)

     Team  Points
0   India     876
1   India     801
8      NZ     758
9      NZ     691
10     NZ     883
11  India     782

## <font color = 'green'>3. Working with CSV files and basic data Analysis Using Pandas</font>

In [1]:
import pandas as pd
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'
df = pd.read_csv(link)

df.head()

                                                 App        Category  ...         Current Ver   Android Ver
0     Photo Editor & Candy Camera & Grid & ScrapBook  ART_AND_DESIGN  ...               1.0.0  4.0.3 and up
1                                Coloring book moana  ART_AND_DESIGN  ...               2.0.0  4.0.3 and up
2  U Launcher Lite  FREE Live Cool Themes, Hide ...  ART_AND_DESIGN  ...               1.2.4  4.0.3 and up
3                              Sketch - Draw & Paint  ART_AND_DESIGN  ...  Varies with device    4.2 and up
4              Pixel Draw - Number Art Coloring Book  ART_AND_DESIGN  ...                 1.1    4.4 and up

[5 rows x 13 columns]

- `info()` function
> Pandas dataframe.info() function is used to get a concise summary of the dataframe. It comes really handy when doing exploratory analysis of the data. To get a quick overview of the dataset we use the dataframe.info() function.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10841 entries, 0 to 10840
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   App             10841 non-null  object
 1   Category        10841 non-null  object
 2   Rating          9367 non-null   float64
 3   Reviews         10841 non-null  object
 4   Size            10841 non-null  object
 5   Installs        10841 non-null  object
 6   Type            10840 non-null  object
 7   Price           10841 non-null  object
 8   Content Rating  10840 non-null  object
 9   Genres          10841 non-null  object
 10  Last Updated    10841 non-null  object
 11  Current Ver     10833 non-null  object
 12  Android Ver     10838 non-null  object
dtypes: float64(1), object(12)
memory usage: 1.1+ MB

In [8]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

#### `copy()` function

In [24]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)

In [25]:
de = df
# de.drop(['Rank'], axis = 1, inplace=True)

If we normal do:<br>
de=df<br> 
Then a change in `de` will affect the data of `df` as well so we need to copy in such a way that it creates a totally new object and does not affect the old dataframe

In [ ]:
de.head()

In [ ]:
df.head()

In [26]:
de = df.copy()

Adding new column "New" in de

In [27]:
de['New'] = 0

In [30]:
# de.head()
df.head()           # "New" column is not present in df

        Team  Rank  Year  Points
0      India     2  2014     876
1      India     3  2015     801
2  Australia     1  2014     891
3  Australia     2  2015     815
4         SA     3  2014     776

#### `value_counts()` function

Pandas Series.value_counts() function return a Series containing counts of unique values. The resulting object will be in descending order so that the first element is the most frequently-occurring element. Excludes NA values by default.

Syntax: Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)

In [33]:
df['Team'].value_counts()

Team
SA           4
India        3
NZ           3
Australia    2
Name: count, dtype: int64

#### `unique and nunique functions`

While analyzing the data, many times the user wants to see the unique values in a particular column, which can be done using Pandas unique() function.

In [35]:
df['Team'].unique()

array(['India', 'Australia', 'SA', 'NZ'], dtype=object)

While analyzing the data, many times the user wants to see the unique values in a particular column. Pandas nunique() is used to get a count of unique values.

In [36]:
df['Team'].nunique()

4

#### `dropna()` function

Sometimes csv file has null values, which are later displayed as NaN in Data Frame. Pandas dropna() method allows the user to analyze and drop Rows/Columns with Null values in different ways.

Syntax:

DataFrameName.dropna(axis=0,inplace=False)

In [3]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'
import pandas as pd
df = pd.read_csv(link)
df.tail()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10838,Parkinson Exercices FR,MEDICAL,NaN,3,9.5M,"1,000+",Free,0,Everyone,Medical,"January 20, 2017",1.0,2.2 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [4]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [5]:
df.dropna(axis=0, inplace=True)

In [6]:
df.dropna(axis=1, inplace=True)

In [ ]:
df.isnull().sum()

#### `fillna` function

Suppose if we want to fill the null values with something instead of removing them then we can use fillna function<br> Here we will be filling the numerical columns with its mean values and Categorical columns with its mode<br>

In [9]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'
import pandas as pd
df = pd.read_csv(link)
print(len(df))

10841

In [13]:
mis = round(df['Rating'].mean(),2)

df.fillna({'Rating': mis}, inplace = True)    # or df['Rating'] = df['Rating'].fillna(mis)

print(len(df))

10841

In [14]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              1
Price             0
Content Rating    1
Genres            0
Last Updated      0
Current Ver       8
Android Ver       3
dtype: int64

In [17]:
mode_value = df['Current Ver'].mode()[0]
df.fillna({'Current Ver': mode_value}, inplace=True)

#### `sample` function

Pandas sample() is used to generate a sample random row or column from the function caller data frame.

Syntax:

DataFrame.sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None)

In [23]:
# df.sample(n = 3, ignore_index=True)
# df.sample(n = 3)

In [26]:
df.sample(frac = 0.0001)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
1810,Word Crossy - A crossword game,GAME,4.5,240416,53M,"5,000,000+",Free,0,Everyone,Word,"August 1, 2018",2.2.3,4.0.3 and up

In [27]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

df.to_csv('Number.csv')

- We got an extra Unnamed:0 Column if we want to avoid that we need to add an extra parameter mentioning index=False

In [29]:
let = pd.read_csv('Number.csv')
let.head()

   Unnamed: 0  one  two  three  four
0           0    1   10    100  1000
1           1    2   20    200  2000
2           2    3   30    300  3000
3           3    4   40    400  4000

In [30]:
df.to_csv('Number(1).csv', index=False)

In [1]:
# import pandas_profiling as pp
# !pip install ydata_profiling